<h1 align=left><font size = 8, style="color:rgb(200,0,0)"><b>Ciência de Dados </b></font></h1> 
<h1 align=left><font size = 5, style="color:rgb(0,0,0)"><b>Paradigmas de Linguagens de
Programação para Ciência de Dados</b></font></h1> 

# 2 Seleção e Organização de Dados com Pandas
Professores: *Diego Nogare* & *Rogério de Oliveira* 

<br>
<br>

---

# Exercícios

Nos exercícios a seguir emprege a base de dados `titanic`.

Todos exercícios possuem várias soluções possíveis, mas não se preocupe com isso. A melhor solução é primeiro, a que funciona para você!

In [1]:
import numpy as np
import pandas as pd
import seaborn as sns
from random import choices

titanic = sns.load_dataset('titanic')
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

1. Qual a quantidade de linhas e colunas de `titanic`?

In [2]:
titanic.shape

(891, 15)

2. Qual a idade do passageiro mais velho?

In [3]:
print(max(titanic.age))

80.0

3. Qual a idade da sobrevivente feminina mais velha?

In [4]:
selectedTitanic=titanic[['sex','age']]
selectedTitanic=selectedTitanic[titanic.sex=='female']
print(selectedTitanic.max())

sex    female
age      63.0
dtype: object

4. Qual o percentual de sobreviventes da primeira e terceira classes?

In [5]:
titanicSobreviventes=titanic[['survived','class']]
titanicSobreviventes.groupby(['class']).mean()

        survived
class
First   0.629630
Second  0.472826
Third   0.242363

In [6]:
titanicSurvivor=titanic[['survived','pclass']]
titanicSurvivor1=titanicSurvivor[titanicSurvivor['pclass']==1]
passageiros1=len(titanicSurvivor1)
sobreviventes1=len(titanicSurvivor1[titanicSurvivor1['survived']==1])
print(f'Na primeira classe sobreviveram {sobreviventes1/passageiros1:.2%} dos passageiros')

titanicSurvivor3=titanicSurvivor[titanicSurvivor['pclass']==3]
passageiros3=len(titanicSurvivor3)
sobreviventes3=len(titanicSurvivor3[titanicSurvivor3['survived']==1])
print(f'Na terceira classe sobreviveram {sobreviventes3/passageiros3:.2%} dos passageiros')

Na primeira classe sobreviveram 62.96% dos passageiros
Na terceira classe sobreviveram 24.24% dos passageiros

5. Analise a média de idade dos passageiros por classe e sexo (sugestão: empregue groupby). Você pode notar que?

In [7]:
display(titanic[['sex', 'age','class']].groupby(['class','sex']).mean())

display(titanic[['sex', 'age','class']].groupby(['class']).mean())

                     age
class  sex
First  female  34.611765
       male    41.281386
Second female  28.722973
       male    30.740707
Third  female  21.750000
       male    26.507589

              age
class
First   38.233441
Second  29.877630
Third   25.140620